---
kind: other
id: Properties.T:Autodesk.Revit.DB.Visual.AssetPropertyDoubleMatrix44
source: html/a05f0edb-e200-05ba-381e-21d9e78c5898.htm
---
# AssetPropertyDoubleMatrix44 Properties

Identifies if the object is read-only or modifiable.
 If true, the object may not be modified. If false, the object's contents may be modified.